



Run = True
while Run:
    print("to autorised in sustem write your login and password!")
    print("To exit push - 0")
    L = (input("Write yor login! - "))
    P = (input("write your password! - "))
    if P == ("5528715528"):
        Run = False
    if L == ("Alan"):
        print("Yo i Glad too see you!")
        continue
    else:
        print("Plase Try again!")
    if L == ("0"):
        break
    if P == ("0"):
        break

print ("Привет угода число от 1 до 10")
print ("если вы не хотите остановить программу нажмите 0")
stop = 0


running = True
while running:
    guess = int(input("Введите чилсло- "))
    if guess == 8:
        print("поздравляю вы угодали число!")
        running = False
    elif guess == 0:
        print("cпасибо что использовали нашу программу)")
        break
    else:
        print("Число не верно введите еще раз!")
else:
    print ('давайте прицтавим что вы живете на донбасе и вам прилитела ракета в дом!')
    print("каковы ваши действия?")
    print("1) Вы достаните калашмат и подете хуячить всех на лево и на право")
    print("2) Спрячитесь под кравать и будите ждать хороших обстоятельст, что бы свалить в подвал и переждать атаку")
    print("3) Вы хуй ложили на всю эту хуйню и идете взять напас на кухню")
running = True
while running:
    Humen = int(input("Как вы поступите!? - "))
    if Humen == 1:
        print("Вы выбегаете на улицу с калашом но вдруг перед вами взрываеться снаряд, вам отрывает ноги вы исикаете кровь до смерти")
        print('будьте проще характером попробуйте еще раз!')
    elif Humen == 2:
        print("Как только вы спрятались под кравать в гастинной уебал еще один снаряд вы провалились с 3 этажа на 1 и сломали позвоночник ")
        print("Мучительная смерть попробуйте еще раз!")
        
    elif Humen == 3:
        print("вы пошли взяли мелонхолично напас и олько выдыхнули дым как прилител еще один снаряд в ваш дом, вас сильно оглушило гостинная провалилась")
        print("Вы чудом остались в самой безопасной точки дома!")
        print("по обломкам вы спустились на улицу и в состоянии эфекта бежите куда глядят")
        running = False
else:
    print("вы прибежали в лес")


    

    


    
    
    

                              